000100*
000200* PMD 0.01
000300*  COPYRIGHT (C) 2012 COHERENT LOGIC DEVELOPMENT LLC
000400*
000500* CTRLFD.COB: COPYBOOK FOR CONTROL FILE DEF
000600*
000700 FD CONTROL-FILE
000800    LABEL RECORDS ARE STANDARD.
000900 01 CONTROL-RECORD.
000950		05 CONTROL-KEY			PIC 9.
001000    	05 LAST-PROJECT-NUMBER		PIC 9(5).
001100		05 LAST-CUSTOMER-NUMBER		PIC 9(5).
001200		05 LAST-INVOICE-NUMBER		PIC 9(6).
001300		05 LAST-PAYMENT-NUMBER		PIC 9(5).
001400		05 LAST-TASK-NUMBER		PIC 9(5).
001500		05 LAST-TIME-NUMBER		PIC 9(5).
001600
