000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CTRLBLD.
000300 AUTHOR. John Willis
000400*
000500* PMD 0.01
000600* COPYRIGHT (C) 2012 COHERENT LOGIC DEVELOPMENT LLC
000700*
000800* CTRLBLD.COB: BUILD THE CONTROL FILE
000900*
001000*
001100 ENVIRONMENT DIVISION.
001200 INPUT-OUTPUT SECTION.
001300 FILE-CONTROL.
001400
001410		COPY "CTRLSLCT.COB".
001420
001500 DATA DIVISION.
001600 FILE SECTION.
001610
001620		COPY "CTRLFD.COB".
001630
001700
001800 WORKING-STORAGE SECTION.
001900
002000 PROCEDURE DIVISION.
002100 PROGRAM-BEGIN.
002200    	PERFORM OPENING-PROCEDURE.
002300    	PERFORM MAIN-PROCESS.
002400    	PERFORM CLOSING-PROCEDURE.
002500
002600 PROGRAM-EXIT.
002700    	EXIT PROGRAM.
002800
002900 PROGRAM-DONE.
003000    	STOP RUN.
003100
003200 OPENING-PROCEDURE.
003210		OPEN OUTPUT CONTROL-FILE.
003300
003400 CLOSING-PROCEDURE.
003410		CLOSE CONTROL-FILE.
003500
003600 MAIN-PROCESS.
003700		MOVE 1 TO CONTROL-KEY
003710		MOVE ZEROES TO LAST-PROJECT-NUMBER.
003720		MOVE ZEROES TO LAST-CUSTOMER-NUMBER.
003730		MOVE ZEROES TO LAST-INVOICE-NUMBER.
003740		MOVE ZEROES TO LAST-PAYMENT-NUMBER.
003750		MOVE ZEROES TO LAST-TASK-NUMBER.
003760		MOVE ZEROES TO LAST-TIME-NUMBER.
003770		WRITE CONTROL-RECORD.
003780
