000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PRJBLD.
000300*
000400* PMD 0.01
000401*  COPYRIGHT (C) 2012 COHERENT LOGIC DEVELOPMENT LLC
000402*
000403*  PRJBLD.COB: BUILDS AN EMPTY PROJECTS FILE
000500*   $Id$
000550*
000600 ENVIRONMENT DIVISION.
000700 INPUT-OUTPUT SECTION.
000800 FILE-CONTROL.
000850
000900     COPY "PRJSELCT.COB".
001500
001600 DATA DIVISION.
001700 FILE SECTION.
001800
001850     COPY "PRJFD.COB".
002600
002700 WORKING-STORAGE SECTION.
002800
002900 PROCEDURE DIVISION.
003000 PROGRAM-BEGIN.
003100	   OPEN OUTPUT PROJECT-FILE.
003200     CLOSE PROJECT-FILE.
003300
003400 PROGRAM-DONE.
003500     STOP RUN.
003600
