000001*
000002* PMD 0.01
000003*  COPYRIGHT (C) 2012 COHERENT LOGIC DEVELOPMENT LLC
000004*
000005* PRJFD.COB: COPYBOOK FOR PROJECT FILE SECTIONS
000006*  $Id$
000007*
000100 FD  PROJECT-FILE
000200     LABEL RECORDS ARE STANDARD.
000300 01  PROJECT-RECORD.
000400     05 PROJECT-NUMBER				PIC 9(5).
000500     05 PROJECT-NAME				PIC X(40).
000600	   05 PROJECT-DESCRIPTION			PIC X(40).
000700     05 CUSTOMER-NUMBER				PIC 9(5).
000800     05 DUE-DATE					PIC Z9/99/9999.
000900	   05 HOURLY-RATE				PIC 9(5).
000950
