000001*
000002* PMD 0.01
000003*  COPYRIGHT (C) 2012 COHERENT LOGIC DEVELOPMENT LLC
000004*
000005* CUSTFD.COB: COPYBOOK FOR CUSTOMER FILE SECTION
000007*
000100 FD  CUSTOMER-FILE
000200     LABEL RECORDS ARE STANDARD.
000300 01  CUSTOMER-RECORD.
000400     05 CUSTOMER-NUMBER				PIC 9(5).
000500     05 CUSTOMER-NAME				PIC X(60).
000600	   05 CUSTOMER-ADDRESS-1			PIC X(40).
000700     05 CUSTOMER-ADDRESS-2			PIC X(40).
000800     05 CUSTOMER-CITY				PIC X(25).
000900	   05 CUSTOMER-STATE				PIC X(2).
001000	   05 CUSTOMER-ZIP				PIC X(5).
001100	   05 CUSTOMER-PHONE				PIC X(20).
001200	   05 CUSTOMER-FAX				PIC X(20).
001300	   05 CUSTOMER-CONTACT				PIC X(60).
001400     05 CUSTOMER-EMAIL				PIC X(70).
001500
