000050* $Id$
000100 01 ADD-RECORD-SCREEN.
000200	05 BLANK-SCREEN.
000210	05 LINE 1 COL 1
000220	   ERASE EOL
000230	   FOREGROUND-COLOR 7 HIGHLIGHT
000240	   BACKGROUND-COLOR 1 LOWLIGHT
000250	   VALUE "".
000300	05 LINE 1 COL 1
000301     FOREGROUND-COLOR 7 HIGHLIGHT
000302	   BACKGROUND-COLOR 1 LOWLIGHT
000303	   VALUE "PMD".
000400	05 LINE 1 COL 30
000401	   FOREGROUND-COLOR 7 HIGHLIGHT
000402	   BACKGROUND-COLOR 1 LOWLIGHT
000403     VALUE "ADD PROJECT RECORD".
000450  05 LINE 1 COL 64
000451	   FOREGROUND-COLOR 7 HIGHLIGHT
000452	   BACKGROUND-COLOR 1 LOWLIGHT
000453     VALUE "PROJECT #:".
000500	05 LINE 1 COL 76
000501     FOREGROUND-COLOR 7 HIGHLIGHT
000502	   BACKGROUND-COLOR 1 LOWLIGHT
000503     PIC 9(5) FROM PROJECT-NUMBER.
000600	05 LINE 4 COL 10
000601	   FOREGROUND-COLOR 7 HIGHLIGHT
000602	   VALUE "PROJECT NAME:".
000700	05 LINE 4 COL 40 PIC X(40) USING PROJECT-NAME.
000800	05 LINE 6 COL 10
000801	   FOREGROUND-COLOR 7 HIGHLIGHT
000802     VALUE "PROJECT DESCRIPTION:".
000900	05 LINE 6 COL 40 PIC X(40) USING PROJECT-DESCRIPTION.
001000	05 LINE 8 COL 10
001001	   FOREGROUND-COLOR 7 HIGHLIGHT
001002     VALUE "CUSTOMER NUMBER:".
001100	05 LINE 8 COL 40 PIC 9(5) USING CUSTOMER-NUMBER.
001200	05 LINE 10 COL 10
001201	   FOREGROUND-COLOR 7 HIGHLIGHT
001202     VALUE "DUE DATE:".
001300	05 LINE 10 COL 40 PIC Z9/99/9999 USING DUE-DATE.
001400	05 LINE 12 COL 10
001401	   FOREGROUND-COLOR 7 HIGHLIGHT
001402	   VALUE "HOURLY RATE:".
001500	05 LINE 12 COL 40 PIC 9(5) USING HOURLY-RATE.
001600  05 LINE 23 COL 1
001700	   ERASE EOL
001800	   FOREGROUND-COLOR 7
001900	   BACKGROUND-COLOR 1 LOWLIGHT
002000	   PIC X(50) FROM STATUS-MSG.
002100	05 LINE 24 COL 1
002150	   ERASE EOL
002200	   FOREGROUND-COLOR 7 HIGHLIGHT
002300	   BACKGROUND-COLOR 1 LOWLIGHT
002400	   PIC X(80) FROM ERROR-MSG.
002500  05 LINE 15 COL 10 PIC X(30) FROM CONTINUE-MSG.
002600	05 LINE 15 COL 40 PIC X USING OK-TO-WRITE.
